OdDAI.IEventCollector.logEvent(OdSmartPtr&lt;OdDAI.ErrorEvent&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Logs an error event to the error events list (writes error data in the log).
\param eventToRecord [in] An error event object that contains information to be logged.

OdDAI.IEventCollector.logEvent(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.UInt32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Logs an error event to the error events list (writes error data in the log).
\param functionID [in] A null-terminated string that contains the function name.
\param error [in] An error identifier.
\param descpt [in] A null-terminated string that contains the error description.

OdDAI.IEventCollector.onStopEventRecording
\details
A handler method that is called when event recording ends.
This method must be implemented for any class that implements the event logger interface.

OdDAI.IEventCollector.onStartEventRecording
\details
A handler method that is called when event recording starts.
This method must be implemented for any class that implements the event logger interface.

OdDAI.IEventCollector.Dispose
\details
Destroys the event collector object.

OdDAI.IEventCollector
\details
An abstract class that provides an interface of a custom event logger (or a custom error event list flusher).